
{
    "catalogue": [
        {
            "id": 35,
            "title": "De 'Gagné-fermé' au Lancement en Quelques Minutes : Automatisation de la Configuration de Projet",
            "industry": "Services professionnels",
            "technology": "Power Automate",
            "miniDescription": "Passez en toute transparence d'une affaire 'gagnée-fermée' dans votre CRM à un projet entièrement provisionné et prêt à démarrer en quelques minutes.",
            "technicalLevel": 8,
            "problem": "Une directrice des ventes marque une opportunité comme 'Gagnée-fermée' dans Salesforce. Ce simple clic devrait être un moment de célébration, mais il déclenche une course manuelle effrénée. Le chef de projet doit créer manuellement un nouveau canal Teams, une structure de dossiers SharePoint, un plan de projet dans Planner, puis informer l'équipe financière de configurer le code de facturation. Le processus prend des heures.",
            "value": "Pour toute entreprise de services professionnels, le moment où une affaire est gagnée est critique. Cette solution crée un transfert transparent et automatisé des ventes à la livraison.",
            "roi": "Le ROI se mesure en heures non facturables économisées et en démarrages de projets plus rapides.\nA = Heures économisées par projet sur la configuration manuelle.\nB = Nombre de nouveaux projets par an.\nC = La valeur stratégique de commencer le travail facturable plus rapidement.\n\n<code>Formule :\nÉconomies Annuelles = (A * B * Coût Horaire du Personnel) + (Valeur d'une Facturation plus Rapide, C)</code>\n\nExemple : Élimine des heures de temps de configuration manuel et non facturable pour chaque projet. Assure que chaque projet est configuré avec une structure cohérente et de meilleures pratiques. Permet à l'équipe de projet d'interagir plus rapidement avec le client.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Orchestration Axée sur la Transaction</h5><p>Il s'agit d'une orchestration classique 'pilotée par les événements' qui part d'un déclencheur dans votre CRM.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Fondation (CRM, Modèles et API) :</strong> L'enregistrement de l'opportunité de votre CRM doit être la source unique de vérité.</li><li><strong>Construire le Moteur de Provisionnement (Le Flux Power Automate) :</strong> Créez un flux cloud automatisé avec le déclencheur pour votre CRM. Le flux doit lire les données du CRM, créer un projet dans le système financier via l'API, créer une nouvelle équipe Microsoft Team, créer un plan Planner et y ajouter les membres de l'équipe assignés.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Créez une structure de projet standardisée automatiquement. Au lieu de simplement créer une équipe et un plan Planner vierges, faites en sorte que le flux crée également des canaux standards et des compartiments Planner pour garantir que chaque projet commence avec une structure de meilleures pratiques.</p>"
        },
        {
            "id": 36,
            "title": "Le Gardien Numérique : Automatisation des Vérifications de Conflits d'Intérêts Clients",
            "industry": "Services professionnels",
            "technology": "Power Automate",
            "miniDescription": "Automatisez et normalisez le processus critique de vérification des conflits d'intérêts clients, en offrant rapidité, certitude et en atténuant les risques catastrophiques.",
            "technicalLevel": 9,
            "problem": "Un associé d'un cabinet d'avocats est sur le point de prendre un nouveau client. Avant cela, un jeune collaborateur est chargé de la vérification des conflits. Cela implique de rechercher manuellement dans plusieurs bases de données internes et sources externes toute relation conflictuelle. Le processus est lent, repose sur la mémoire institutionnelle et comporte l'immense risque de manquer un conflit.",
            "value": "Pour les cabinets d'avocats, les sociétés de conseil et les conseillers financiers, la vérification des conflits d'intérêts clients est une étape non négociable à enjeux élevés. Cette solution automatise et normalise cette passerelle critique.",
            "roi": "Le ROI est presque entièrement lié à l'atténuation des risques.\nA = Heures économisées par vérification de conflit.\nB = L'immense valeur d'éviter un seul conflit d'intérêts majeur.\nC = La valeur de pouvoir s'engager plus rapidement avec de nouveaux clients.\n\n<code>Formule :\nProposition de Valeur = Évitement de Risque Catastrophique (B) + Engagement plus Rapide (C) + Économies Opérationnelles (A)</code>\n\nExemple : Bien que l'économie de 4 à 5 heures de travail manuel par vérification soit un gain d'efficacité appréciable, la vraie valeur est B. Un seul conflit manqué dans une affaire de plusieurs millions d'euros pourrait coûter au cabinet la totalité des honoraires et nuire à sa réputation pendant des années.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Hybride</h5><p>Une demande de vérification de conflit doit être formelle et précise. Une simple Power App fournit l'interface structurée idéale. La recherche backend à travers plusieurs systèmes est une orchestration complexe, parfaite pour un puissant flux Power Automate.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Fondation (Sources de Données & API) :</strong> Vous avez besoin d'un accès API en lecture seule à tous les systèmes pertinents.</li><li><strong>Construire l'Interface de Demande (La Power App) :</strong> Créez une application canevas simple avec un formulaire pour le client potentiel et toutes les autres parties impliquées.</li><li><strong>Créer le Moteur de Recherche (Le Flux Power Automate) :</strong> Utilisez le déclencheur 'PowerApps (V2)'. Utilisez une branche parallèle pour rechercher tous les systèmes simultanément. Compilez tous les 'résultats' dans un seul rapport et postez-le sous forme de carte adaptative au responsable de la conformité.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Créez un 'graphe de relations' pour une analyse avancée. Pour chaque conflit potentiel trouvé, le flux peut non seulement signaler le 'résultat', mais aussi interroger les systèmes sources pour les entités liées (par exemple, les membres du conseil d'administration d'une société en conflit).</p>"
        },
        {
            "id": 37,
            "title": "L'Auditeur Instantané : Un Bot IA pour les Politiques de Temps et de Dépenses",
            "industry": "Services professionnels",
            "technology": "Copilot Studio",
            "miniDescription": "Construisez un Copilote IA qui fournit des réponses immédiates, précises et cohérentes à toutes les questions des employés sur les politiques de temps et de dépenses.",
            "technicalLevel": 2,
            "problem": "Une consultante, Sarah, est sur le point de soumettre sa note de frais hebdomadaire. Elle n'est pas sûre de pouvoir réclamer le Wi-Fi qu'elle a acheté pendant son vol. Elle passe cinq minutes à chercher la politique de voyage sur l'intranet de l'entreprise, ne trouve pas de réponse claire et finit par envoyer un e-mail au service d'assistance financière. Un employé de la finance doit alors trouver la section pertinente de la politique et lui répondre.",
            "value": "Dans toute entreprise de services professionnels, le temps et les dépenses sont la pierre angulaire de l'activité. Ils sont aussi une source infinie de questions de la part des employés. Répondre à ces questions répétitives est une perte de temps majeure. Ce guide vous montrera comment construire un 'Auditeur Instantané', un Copilote alimenté par l'IA qui fournit des réponses immédiates, précises et cohérentes 24/7.",
            "roi": "Le retour se mesure en productivité récupérée dans toute l'entreprise.\nA = Nombre de questions liées aux politiques détournées du service d'assistance.\nB = Temps économisé par employé qui peut maintenant se servir lui-même.\nC = La valeur d'une meilleure conformité et d'une réduction du nombre de notes de frais mal remplies.\n\n<code>Formule :\nProposition de Valeur = (Économies du Service d'Assistance, A) + (Gain de Productivité des Employés, B) + Conformité Améliorée (C)</code>\n\nExemple : Si vous détournez 300 requêtes par mois de votre équipe financière (A), vous économisez des dizaines d'heures. L'impact plus important est B : si chacun de vos 1 000 employés économise seulement 10 minutes par mois, cela représente plus de 160 heures de temps productif récupérées chaque mois.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Purement Basée sur l'Action Générative</h5><p>Les questions des employés sur les dépenses sont conversationnelles et spécifiques. La tâche principale de l'IA est de comprendre la question en langage naturel et de trouver la réponse précise dans les documents de politique officiels de l'entreprise. C'est le travail parfait pour les Réponses Génératives.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Fondation (Le Hub de Politiques) :</strong> Créez un site SharePoint Online dédié et sécurisé pour héberger tous les documents de politique officiels.</li><li><strong>Construire le Cerveau IA (Configurer les Réponses Génératives) :</strong> Dans Copilot Studio, créez un nouveau Copilote. Dans la section IA Générative, entrez l'URL de la bibliothèque de politiques SharePoint.</li><li><strong>Tester et Déployer :</strong> Testez minutieusement le Copilote avec vos équipes financières et RH. Une fois confiant, déployez-le à tous les employés via Microsoft Teams.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Passez de la réponse aux questions à l'automatisation des actions. Créez un simple plugin d'Action Générative appelé 'Obtenir le Statut de la Note de Frais'. Le flux prend l'ID de l'employé, appelle l'API du système financier et renvoie le statut.</p>"
        },
        {
            "id": 53,
            "title": "Intégration et Départ des Consultants",
            "industry": "Services professionnels",
            "technology": "Power Automate",
            "miniDescription": "Automatisez le cycle de vie complet des consultants externes, de l'attribution des accès à un départ sécurisé et ponctuel.",
            "technicalLevel": 7,
            "problem": "Une nouvelle consultante, Maria, rejoint un projet majeur. Le chef de projet envoie un e-mail à l'informatique pour obtenir son compte, puis un autre e-mail à une autre équipe pour obtenir son accès au site SharePoint du client. Le processus prend deux jours. Lorsque son contrat se termine trois mois plus tard, le chef de projet oublie d'informer l'informatique, et son compte reste actif pendant deux semaines, créant un risque de sécurité important.",
            "value": "Les entreprises de services professionnels font largement appel à des consultants et sous-traitants externes. La gestion de leur cycle de vie est un défi de sécurité et opérationnel essentiel.",
            "roi": "Le ROI concerne principalement la sécurité et l'agilité.\n\n<code>Formule :\nValeur = (Coût d'une Violation de Sécurité Évitée) + (Valeur de Démarrages de Consultants plus Rapides)</code>\n\nExemple : Le ROI principal est la sécurité et l'atténuation des risques. Il élimine le risque que d'anciens consultants conservent l'accès à des données clients sensibles. Il accélère également considérablement le processus d'intégration, rendant l'entreprise plus agile.",
            "implementationGuide": "<h5>Le Plan de la Solution : Deux Flux de Cycle de Vie</h5><p>Cette solution utilise deux flux Power Automate pour gérer le début et la fin du cycle de vie des consultants.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Configurer une Source de Données :</strong> Utilisez une liste SharePoint ou une table Dataverse pour stocker les informations des consultants, y compris leur date de fin de contrat.</li><li><strong>Construire le Flux d'Intégration :</strong> Déclenchez à partir d'une Power App. Utilisez l'action 'Démarrer et attendre une approbation'. Utilisez l'action 'Créer un utilisateur' du connecteur Azure AD. Utilisez l'action 'Ajouter un membre à une équipe' de Teams.</li><li><strong>Construire le Flux de Départ :</strong> Créez un flux cloud planifié. Utilisez une action 'Obtenir les éléments' avec une requête de filtre pour trouver tous les consultants dont la date de fin de contrat est aujourd'hui. Parcourez les résultats et utilisez l'action 'Mettre à jour l'utilisateur' d'Azure AD pour désactiver le compte.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Intégrez avec le suivi du temps. Avant de désactiver le compte, le flux de départ pourrait d'abord effectuer un appel API au système de suivi du temps de l'entreprise pour vérifier si le consultant a des feuilles de temps non soumises. Si c'est le cas, le flux peut générer un rappel concis et l'envoyer au consultant.</p>"
        },
        {
            "id": 54,
            "title": "Automatisation de la Configuration de Projet",
            "industry": "Services professionnels",
            "technology": "Power Automate",
            "miniDescription": "Automatisez la création d'un environnement de projet standard et de meilleures pratiques dans Microsoft Teams et SharePoint pour chaque nouvel engagement client.",
            "technicalLevel": 6,
            "problem": "Un associé signe un nouvel engagement client. Il demande à son assistant de direction de 'configurer le projet'. L'assistant passe une heure à créer une nouvelle équipe, à ajouter les membres principaux du projet, à créer une structure de dossiers standard dans le site SharePoint et à copier un modèle de budget d'un projet précédent.",
            "value": "Chaque nouveau projet client dans une entreprise de services professionnels nécessite un ensemble standard de ressources. La création manuelle de ces ressources pour chaque projet est répétitive et conduit à des structures incohérentes.",
            "roi": "Le ROI se mesure en efficacité et en cohérence.\n\n<code>Formule :\nÉconomies Annuelles = (Heures Économisées par Projet * Projets par An * Coût Horaire du Personnel)</code>\n\nExemple : Économise des dizaines d'heures de travail administratif par mois. Applique la cohérence à tous les projets. Garantit que les meilleures pratiques de configuration de projet sont suivies à chaque fois.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail de Provisionnement</h5><p>Il s'agit d'un flux de travail de provisionnement qui crée un environnement de projet cohérent à chaque fois.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Créer des Modèles :</strong> Concevez votre structure de dossiers de projet idéale et créez un fichier de modèle de budget Excel standard.</li><li><strong>Construire le Flux :</strong> Déclenchez le flux depuis votre Power App. Utilisez l'action 'Créer une équipe' du connecteur Teams. Parcourez la liste des membres de l'équipe et utilisez l'action 'Ajouter un membre à une équipe'. Utilisez l'action 'Copier le fichier' de SharePoint pour copier votre modèle de budget. Utilisez des actions 'Envoyer une requête HTTP à SharePoint' pour appliquer votre structure de dossiers standard.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Intégrez avec votre CRM. Déclenchez le flux automatiquement lorsqu'une opportunité de vente dans votre CRM est marquée comme 'Gagnée'. Le flux peut extraire le nom du client, la valeur du projet et l'équipe assignée directement depuis le CRM.</p>"
        },
        {
            "id": 55,
            "title": "Vérification des Conflits d'Intérêts Clients",
            "industry": "Services professionnels",
            "technology": "Power Automate",
            "miniDescription": "Automatisez et normalisez le processus critique de vérification des conflits d'intérêts clients, en offrant rapidité, certitude et en atténuant les risques catastrophiques.",
            "technicalLevel": 9,
            "problem": "Un associé veut prendre un nouveau client, 'Innovate Corp'. Un collaborateur est chargé de la vérification des conflits. Il doit rechercher manuellement le CRM de l'entreprise pour 'Innovate Corp', mais aussi pour ses dirigeants, sa société mère et ses filiales. Il doit ensuite rechercher les affaires passées. Le processus est lent.",
            "value": "Avant qu'un cabinet d'avocats ou une société de conseil puisse prendre un nouveau client, il a l'obligation légale et éthique d'effectuer une vérification des conflits. Il s'agit d'un processus de gestion des risques essentiel qui est souvent manuel et long.",
            "roi": "Le ROI est mesuré presque entièrement en atténuation des risques.\n\n<code>Formule :\nProposition de Valeur = Évitement de Risque Catastrophique + Engagement plus Rapide + Économies Opérationnelles</code>\n\nExemple : Bien que l'économie de 4 à 5 heures de travail manuel par vérification soit un grand gain d'efficacité, la vraie valeur est d'éviter un seul conflit manqué dans une affaire de plusieurs millions d'euros, ce qui pourrait coûter au cabinet la totalité des honoraires et nuire à sa réputation.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Hybride</h5><p>Une demande de vérification de conflit doit être formelle et précise. Une simple Power App fournit l'interface structurée idéale. La recherche backend à travers plusieurs systèmes est une orchestration complexe, parfaite pour un puissant flux Power Automate.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Fondation (Sources de Données & API) :</strong> Vous avez besoin d'un accès API en lecture seule à tous les systèmes pertinents (CRM, Finance, Gestion de Documents).</li><li><strong>Construire l'Interface de Demande (La Power App) :</strong> Créez une application canevas simple avec un formulaire pour le client potentiel et toutes les autres parties impliquées.</li><li><strong>Créer le Moteur de Recherche (Le Flux Power Automate) :</strong> Utilisez le déclencheur 'PowerApps (V2)'. Utilisez une branche parallèle pour rechercher tous les systèmes simultanément. Compilez tous les 'résultats' dans un seul rapport et postez-le sous forme de carte adaptative au responsable de la conformité.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Utilisez la correspondance approximative. Au lieu de recherches de noms exactes, utilisez un prompt AI Builder dans votre flux. Le prompt peut prendre les noms d'entrée et générer une liste de variations potentielles. Le flux recherche alors toutes ces variations, augmentant la probabilité de trouver un conflit subtil.</p>",
            "interactiveComponent": "ConflictCheckDemo"
        },
        {
            "id": 56,
            "title": "Bot de Requête sur les Politiques de Temps et de Dépenses",
            "industry": "Services professionnels",
            "technology": "Copilot Studio",
            "miniDescription": "Construisez un Copilote IA qui fournit des réponses immédiates, précises et cohérentes à toutes les questions des employés sur les politiques de temps et de dépenses.",
            "technicalLevel": 2,
            "problem": "Une consultante, Sarah, est sur le point de soumettre sa note de frais hebdomadaire. Elle n'est pas sûre de pouvoir réclamer le Wi-Fi qu'elle a acheté pendant son vol. Elle passe cinq minutes à chercher la politique de voyage sur l'intranet de l'entreprise, puis appelle son assistant pour vérifier, ce qui fait perdre du temps aux deux.",
            "value": "Les consultants et les avocats voyagent constamment et engagent des dépenses. Ils ont fréquemment des questions sur les politiques de l'entreprise. Répondre manuellement à ces questions incombe aux assistants administratifs ou au service financier. Cette solution fournit une réponse instantanée en libre-service.",
            "roi": "Le retour se mesure en productivité récupérée dans toute l'entreprise.\n\n<code>Formule :\nProposition de Valeur = (Économies du Service d'Assistance) + (Gain de Productivité des Employés) + Conformité Améliorée</code>\n\nExemple : Si vous détournez 300 requêtes par mois de votre équipe financière, vous économisez des dizaines d'heures. L'impact plus important est que si chacun de vos 1 000 employés économise seulement 10 minutes par mois, cela représente plus de 160 heures de temps productif récupérées chaque mois.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Purement Basée sur l'Action Générative</h5><p>Les questions des employés sur les dépenses sont conversationnelles et spécifiques. La tâche principale de l'IA est de comprendre la question en langage naturel et de trouver la réponse précise dans les documents de politique officiels de l'entreprise. C'est le travail parfait pour les Réponses Génératives.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Fondation (Le Hub de Politiques) :</strong> Créez un site SharePoint Online dédié et sécurisé pour héberger tous les documents de politique officiels.</li><li><strong>Construire le Cerveau IA (Configurer les Réponses Génératives) :</strong> Dans Copilot Studio, créez un nouveau Copilote. Dans la section IA Générative, entrez l'URL de la bibliothèque de politiques SharePoint.</li><li><strong>Tester et Déployer :</strong> Testez minutieusement le Copilote avec vos équipes financières et RH. Une fois confiant, déployez-le à tous les employés via Microsoft Teams.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Passez de la réponse aux questions à l'automatisation des actions. Créez un simple plugin d'Action Générative appelé 'Obtenir le Statut de la Note de Frais'. Le flux prend l'ID de l'employé, appelle l'API du système financier et renvoie le statut.</p>"
        }
    ]
}
