
{
    "catalogue": [
        {
            "id": 30,
            "title": "La Mairie 24/7 : Automatisation des Demandes de Services des Citoyens",
            "industry": "Secteur public",
            "technology": "Copilot Studio & Power Automate",
            "miniDescription": "Créez un assistant IA qui permet aux citoyens de signaler instantanément des problèmes non urgents comme des nids-de-poule ou des lampadaires cassés, à toute heure du jour.",
            "technicalLevel": 5,
            "problem": "Une résidente, Jane, remarque que le lampadaire de son coin de rue est éteint depuis deux jours. Elle appelle la hotline 311 de la ville. Après avoir navigué dans un menu téléphonique et attendu dix minutes, elle parle enfin à un opérateur. Elle décrit le problème et l'emplacement, et l'opérateur crée manuellement un ordre de travail dans le système des travaux publics. Le processus est lent, peu pratique pour Jane et coûteux pour la ville.",
            "value": "Pour les gouvernements locaux, répondre aux besoins des citoyens est au cœur de leur mission. Pourtant, les principaux canaux pour signaler les problèmes non urgents - comme les nids-de-poule, les lampadaires cassés ou les collectes d'ordures manquées - sont souvent des centres d'appels inefficaces avec de longs temps d'attente. Cela crée de la frustration pour les citoyens et un coût opérationnel élevé pour la municipalité. Ce guide vous montrera comment construire une 'Mairie 24/7', un assistant alimenté par l'IA qui permet aux citoyens de signaler les problèmes instantanément, à toute heure du jour, et offre une meilleure expérience pour tous.",
            "roi": "Le retour sur investissement se mesure en économies de coûts directes grâce à la déviation des appels et à une amélioration significative de la satisfaction des citoyens (CSAT).\nA = Nombre d'appels non urgents déviés du centre d'appels en direct par mois.\nB = Coût moyen pour traiter un appel d'opérateur en direct.\nC = La valeur stratégique de l'amélioration du CSAT, de l'engagement civique et de la confiance dans le gouvernement local.\n\n<code>Formule :\nÉconomies mensuelles = (A * B) + Valeur de l'amélioration de la confiance des citoyens (C)</code>\n\nExemple : Si le bot dévie 5 000 appels par mois (A) à un coût moyen de 6 € par appel (B), la ville économise 30 000 € chaque mois en coûts opérationnels directs. La valeur de fournir un service moderne et réactif aux citoyens (C) est encore plus grande, favorisant une communauté plus positive et engagée.",
            "implementationGuide": "<h5>Le plan de la solution : une approche purement basée sur l'action générative</h5><p>Les citoyens signaleront les problèmes en utilisant leurs propres mots. La tâche principale de l'IA est de comprendre la demande du citoyen, de classer le type de problème et d'extraire l'emplacement. Un sujet scénarisé serait impossible à construire pour tous les problèmes potentiels et semblerait bureaucratique pour un citoyen.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Créez une liste de routage :</strong> Créez une simple liste SharePoint qui mappe les mots-clés de type de demande au service responsable et à ses coordonnées/détails système. Cela facilite la mise à jour de la logique de routage sans modifier le flux.</li><li><strong>Construisez le moteur de service (le plugin Power Automate) :</strong> Nommez-le 'Créer une demande de service citoyen'. La description pour l'IA devrait être : 'Utilisez ceci pour enregistrer une nouvelle demande de service non urgente d'un citoyen. Il nécessite le type de problème et une description détaillée de l'emplacement.' Les entrées devraient être TypeDeProblème et DescriptionEmplacement. Le flux devrait appeler l'API de votre système d'ordres de travail, créer le ticket, analyser l'ID de cas retourné et le renvoyer à l'utilisateur.</li><li><strong>Activez le plugin dans Copilot Studio :</strong> Trouvez simplement votre nouveau plugin dans votre Copilot public et activez-le.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Bouclez la boucle avec des mises à jour de statut proactives. Créez un flux Power Automate distinct qui se déclenche lorsque le statut d'un ordre de travail est mis à jour dans le système des travaux publics. Le flux peut alors envoyer automatiquement une notification par e-mail ou SMS au citoyen qui a initialement signalé le problème. 'Bonne nouvelle ! Le nid-de-poule que vous avez signalé sur la rue Principale a été réparé.'</p>"
        },
        {
            "id": 31,
            "title": "Simplifiez les démarches : automatisation des demandes de permis et des vérifications de statut",
            "industry": "Secteur public",
            "technology": "Copilot Studio & Power Automate",
            "miniDescription": "Créez un assistant numérique pour les permis qui rationalise l'ensemble du cycle de vie, d'une application guidée aux vérifications de statut à la demande.",
            "technicalLevel": 7,
            "problem": "Une propriétaire d'entreprise locale, Maria, veut demander un permis pour installer une nouvelle enseigne sur sa vitrine. Elle doit télécharger un formulaire PDF confus de 10 pages, le remplir à la main, puis l'envoyer par la poste ou le déposer à la mairie. Une semaine plus tard, pour vérifier le statut, sa seule option est d'appeler une ligne d'information générale, où un employé doit chercher manuellement dans une base de données pour lui donner une mise à jour vague. Le processus est inefficace pour la ville et une source majeure de frustration pour Maria.",
            "value": "Pour toute municipalité, le processus de délivrance de permis - pour tout, de la construction d'une terrasse à l'ouverture d'un nouveau restaurant - est une fonction essentielle. C'est aussi notoirement lent, basé sur le papier et opaque. Les citoyens et les propriétaires d'entreprise sont souvent frustrés par les formulaires déroutants et la 'boîte noire' du processus d'approbation, sans visibilité sur le statut de leur demande. Ce guide vous montrera comment construire un assistant numérique pour les permis qui rationalise l'ensemble du cycle de vie, de la demande à la vérification du statut.",
            "roi": "Le retour sur investissement se mesure en temps de personnel économisé, en amélioration de la satisfaction des citoyens/entreprises et en accélération de l'activité économique.\nA = Heures économisées par le personnel de la ville sur la saisie manuelle des données et la réponse aux appels de statut.\nB = La valeur économique de l'accélération du processus de délivrance des permis, permettant aux entreprises d'ouvrir ou de se développer plus rapidement.\nC = La valeur stratégique d'être perçue comme une ville moderne, efficace et favorable aux entreprises.\n\n<code>Formule :\nProposition de valeur = Accélération économique (B) + Perception améliorée (C) + Économies opérationnelles (A)</code>\n\nExemple : Si l'automatisation du processus de délivrance des permis aide une nouvelle entreprise de vente au détail à ouvrir un mois plus tôt, la ville bénéficie de ce mois supplémentaire de recettes fiscales et d'emplois. Cet impact économique (B) sur de nombreuses entreprises est bien plus important que les économies de coûts directes liées à la réduction du travail administratif.",
            "implementationGuide": "<h5>Le plan de la solution : une approche hybride</h5><p>La demande de permis elle-même est un processus juridique et axé sur la conformité. Un sujet guidé est la meilleure façon de guider un citoyen à travers le formulaire complexe, en veillant à ce que chaque champ obligatoire soit rempli correctement et que chaque document nécessaire soit téléchargé. La deuxième partie du cas d'utilisation, la vérification du statut, est une action générative parfaite. Un citoyen demandera : 'Quel est le statut de ma demande de permis #P-12345 ?' et l'IA devra extraire l'ID et interroger le système.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Préparez votre fondation (système de permis et Dataverse) :</strong> Vous avez besoin d'un accès API à votre système de permis principal pour enregistrer les nouvelles demandes et interroger leur statut.</li><li><strong>Construisez la saisie des demandes (le sujet guidé) :</strong> Dans Copilot Studio, créez un nouveau sujet : 'Demander un permis d'enseigne commerciale'. Travaillez avec le service de l'urbanisme pour mapper le formulaire papier en une séquence de nœuds de question.</li><li><strong>Construisez le vérificateur de statut (le plugin d'action générative) :</strong> Dans Power Automate, créez un nouveau flux déclenché par 'Exécuter depuis Copilot'. Définissez le plugin avec un nom, une description et une entrée NuméroDeDemande. Le flux devrait appeler l'API de votre système de permis pour obtenir le statut et le retourner à l'utilisateur.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Automatisez le flux de travail d'approbation. Le flux 'Demander un permis' peut également orchestrer les approbations. Après avoir enregistré la demande, le flux peut utiliser le connecteur Approbations pour attribuer automatiquement des tâches d'examen aux services requis (par exemple, Urbanisme, Incendie, Travaux publics) de manière séquentielle ou parallèle.</p>"
        },
        {
            "id": 32,
            "title": "Du retard au progrès : automatisation de la gestion des demandes FOIA",
            "industry": "Secteur public",
            "technology": "Power Automate",
            "miniDescription": "Rationalisez l'ensemble du cycle de vie de la loi sur la liberté d'information (FOIA), d'un portail de saisie structuré au suivi automatisé des délais et à l'attribution des tâches.",
            "technicalLevel": 8,
            "problem": "Un journaliste, Tom, soumet une demande FOIA par e-mail pour toutes les communications relatives à une récente décision de zonage. Le bureau du greffier de la ville reçoit l'e-mail, l'enregistre manuellement dans une feuille de calcul, puis transmet la demande à trois chefs de service différents. Chaque service doit alors chercher manuellement dans ses propres fichiers et e-mails. Le processus est lent, difficile à suivre, et il y a un risque élevé qu'un document pertinent soit manqué ou qu'un délai passe inaperçu.",
            "value": "Pour les agences gouvernementales, répondre aux demandes de la loi sur la liberté d'information (FOIA) ou aux demandes de documents publics est une obligation légale. C'est aussi un processus complexe et laborieux qui implique l'enregistrement des demandes, la recherche de documents dans plusieurs services, la rédaction d'informations sensibles et le suivi de délais légaux stricts. Cet effort manuel entraîne souvent des retards importants et un non-respect potentiel. Ce guide vous montrera comment construire un système automatisé qui rationalise l'ensemble du cycle de vie FOIA, de la saisie à la livraison.",
            "roi": "Le retour sur investissement se mesure en temps de personnel économisé, en amélioration de la conformité et en transparence publique accrue.\nA = Heures économisées par demande sur l'enregistrement, le routage et le suivi manuels.\nB = Nombre de demandes FOIA reçues par an.\nC = La valeur significative d'éviter les litiges ou les amendes en raison du non-respect des délais légaux.\n\n<code>Formule :\nÉconomies annuelles = (A * B * Coût horaire du personnel) + (Valeur de la conformité, C)</code>\n\nExemple : Si vous économisez 2 heures de travail administratif par demande (A) et traitez 500 demandes par an (B), vous économisez 1 000 heures de temps de personnel. La valeur principale, cependant, est C - garantir que l'agence respecte ses obligations légales à chaque fois, ce qui renforce la confiance du public et évite des contestations judiciaires coûteuses.",
            "implementationGuide": "<h5>Le plan de la solution : une approche hybride</h5><p>La saisie initiale de la demande FOIA doit être un processus structuré et formel. Un portail Power Pages public fournit l'interface sécurisée idéale pour cela. Le flux de travail backend complexe - suivi des délais, attribution des tâches de recherche aux services et compilation du dossier final de documents - est un travail parfait pour un flux Power Automate puissant.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Préparez votre fondation (portail et Dataverse) :</strong> Créez un portail Power Pages simple et public avec un formulaire pour soumettre de nouvelles demandes FOIA. Créez une table Dataverse 'DemandesFOIA' pour être votre source unique de vérité.</li><li><strong>Construisez le moteur de saisie et d'orchestration (le flux Power Automate) :</strong> Créez un nouveau flux déclenché 'Lorsqu'une ligne est ajoutée' à votre table Dataverse. Le flux devrait calculer le délai, utiliser un contrôle Switch pour attribuer des tâches aux services en fonction de mots-clés, envoyer un accusé de réception au demandeur et utiliser une action 'Retarder jusqu'à' pour définir un rappel avant le délai.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Rationalisez le processus d'examen des documents. Créez une bibliothèque de documents SharePoint sécurisée pour chaque demande FOIA. Pour l'étape finale, vous pouvez vous intégrer à Microsoft Purview Information Protection, qui peut utiliser l'IA pour identifier et suggérer automatiquement des expurgations d'informations sensibles avant la publication des documents.</p>"
        },
        {
            "id": 33,
            "title": "Le conseiller numérique : un bot de politique alimenté par l'IA pour les fonctionnaires",
            "industry": "Secteur public",
            "technology": "Copilot Studio",
            "miniDescription": "Créez un Copilot alimenté par l'IA qui fournit aux fonctionnaires des réponses instantanées, précises et cohérentes à toute question de politique interne.",
            "technicalLevel": 2,
            "problem": "Un employé des travaux publics, David, doit acheter de nouveaux équipements de sécurité. Il n'est pas sûr du processus d'approvisionnement pour les articles de moins de 1 000 €. A-t-il besoin de trois devis ? Peut-il utiliser la carte de crédit du service ? Il passe 20 minutes à chercher sur l'intranet de l'agence, trouve trois documents contradictoires, et finit par abandonner et demander à son responsable, qui doit ensuite passer 10 minutes de plus à trouver la procédure correcte et à jour.",
            "value": "Les agences gouvernementales fonctionnent sur un réseau complexe de politiques, de procédures et de réglementations. Pour les fonctionnaires, trouver une réponse définitive à une question spécifique - sur les frais de déplacement, les règles d'approvisionnement ou les politiques RH - peut signifier naviguer dans un intranet labyrinthique ou demander à un collègue plus expérimenté, ce qui prend du temps à tout le monde. Cette 'friction interne' est une perte de productivité majeure. Ce guide vous montrera comment construire un conseiller numérique, un Copilot alimenté par l'IA qui fournit des réponses instantanées, précises et cohérentes à toute question de politique interne.",
            "roi": "Le retour sur investissement se mesure en productivité récupérée dans l'ensemble de l'organisation.\nA = Temps moyen économisé par employé par semaine en obtenant des réponses instantanées au lieu de chercher ou de demander à d'autres.\nB = Nombre d'employés dans l'agence.\nC = Coût horaire moyen entièrement chargé d'un employé.\n\n<code>Formule :\nGain de productivité annuel = A * B * 52 * C</code>\n\nExemple : Si vous économisez à chacun de vos 1 000 employés (B) seulement 15 minutes par semaine (A=0,25 heure) à un coût mixte de 40 €/heure (C), vous récupérez 13 000 heures de temps productif et **520 000 € de valeur chaque année**. Cela améliore également la satisfaction des employés et garantit que les politiques sont suivies de manière plus cohérente.",
            "implementationGuide": "<h5>Le plan de la solution : une approche purement basée sur l'action générative</h5><p>Les questions des employés sur les politiques sont imprévisibles et très spécifiques. La tâche principale de l'IA est de comprendre la question en langage naturel de l'employé et de trouver la réponse précise dans les documents de politique officiels et fiables de l'agence.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Préparez votre fondation (la source unique de vérité) :</strong> Créez un site SharePoint Online dédié et sécurisé pour servir de bibliothèque unique et faisant autorité pour toutes les politiques et procédures actuelles de l'agence. Archivez toutes les anciennes versions.</li><li><strong>Construisez le cerveau de l'IA (configurez les réponses génératives) :</strong> Dans Copilot Studio, créez un nouveau Copilot. Dans la section 'IA générative', entrez l'URL de la bibliothèque de politiques SharePoint. Réglez la modération du contenu sur 'Élevée'.</li><li><strong>Testez et déployez :</strong> Testez minutieusement le Copilot avec un groupe pilote. Une fois confiant, déployez-le largement via Microsoft Teams.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Utilisez les données du bot pour identifier les politiques confuses. Dans les analyses de Copilot Studio, examinez les transcriptions des conversations. Si de nombreux employés posent des questions sur le même sujet, c'est un signal clair que le document de politique officiel est confus et doit être simplifié.</p>"
        },
        {
            "id": 34,
            "title": "Récupérez votre temps : synthèse de procès-verbaux de réunions publiques alimentée par l'IA",
            "industry": "Secteur public",
            "technology": "Power Automate",
            "miniDescription": "Utilisez l'IA pour écouter l'enregistrement d'une réunion publique et générer un projet de procès-verbal de haute qualité en une fraction du temps.",
            "technicalLevel": 7,
            "problem": "Une réunion du conseil municipal dure trois heures. Le lendemain, le greffier de la ville, Michael, doit bloquer toute sa matinée pour écouter l'enregistrement audio. Il doit transcrire manuellement les décisions clés, noter qui a voté pour et contre chaque motion, et créer un résumé concis des commentaires du public. Le processus est fastidieux, et les procès-verbaux finaux ne sont pas disponibles pour le public avant plusieurs jours.",
            "value": "Pour les greffiers et le personnel administratif du gouvernement, le processus de documentation des réunions publiques est une responsabilité fondamentale. C'est aussi incroyablement chronophage. Le personnel passe des heures à écouter des enregistrements et à transcrire méticuleusement les conversations pour produire les procès-verbaux officiels. Ce processus manuel est une perte de ressources importante qui pourrait être utilisée pour un travail plus précieux au service des citoyens. Ce guide vous montrera comment construire un assistant alimenté par l'IA qui peut écouter une réunion et générer un projet de procès-verbal de haute qualité en une fraction du temps.",
            "roi": "Le retour sur investissement se mesure par une réduction massive des heures administratives manuelles.\nA = Temps moyen pour produire manuellement les procès-verbaux d'une réunion (en heures).\nB = Temps requis pour qu'un humain révise et modifie le projet généré par l'IA (en heures).\nC = Nombre de réunions publiques par mois.\nD = Coût horaire moyen entièrement chargé du personnel administratif.\n\n<code>Formule :\nHeures mensuelles économisées = (A - B) * C\nÉconomies mensuelles = Heures mensuelles économisées * D</code>\n\nExemple : Si une réunion de 3 heures prend 4 heures à traiter manuellement (A), mais que le projet de l'IA ne prend que 30 minutes à réviser et à modifier (B=0,5), vous économisez 3,5 heures par réunion. Avec 10 réunions par mois (C) à un coût de personnel de 40 €/heure (D), vous économisez 35 heures et **1 400 € chaque mois**. Cela augmente également la transparence en permettant de publier les procès-verbaux beaucoup plus rapidement.",
            "implementationGuide": "<h5>Le plan de la solution : un moteur backend avec intervention humaine</h5><p>Il s'agit d'un flux de travail d'automatisation de processus pur déclenché par un événement (l'ajout d'un nouveau fichier d'enregistrement de réunion). L'intelligence vient de la capacité d'Azure AI à transcrire et à résumer l'audio.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Préparez votre fondation (SharePoint et Azure AI) :</strong> Créez une bibliothèque de documents SharePoint avec des dossiers pour les 'Enregistrements de réunions' et les 'Projets de procès-verbaux'. Vous aurez besoin d'un abonnement Azure avec les services Azure AI Speech.</li><li><strong>Construisez le moteur de synthèse (le flux Power Automate) :</strong> Créez un flux cloud automatisé avec le déclencheur SharePoint 'Lorsqu'un fichier est créé dans un dossier'. Le flux devrait utiliser l'action Azure AI Speech 'Transcrire l'audio', puis l'action AI Builder 'Résumer le texte'. Enfin, utilisez l'action Word Online 'Remplir un modèle Microsoft Word' pour créer le projet de document et informer le greffier.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Identifiez automatiquement les points d'action. Après la transcription, utilisez le modèle AI Builder 'Extraire des entités personnalisées du texte', entraîné sur des procès-verbaux passés pour reconnaître les points d'action. Le flux peut alors les lister dans une section distincte du projet de document ou créer des tâches dans Microsoft Planner.</p>"
        },
        {
            "id": 51,
            "title": "Questions sur les avantages sociaux et les politiques des employés",
            "industry": "Secteur public",
            "technology": "Copilot Studio",
            "miniDescription": "Fournissez un outil en libre-service permettant aux employés d'obtenir des réponses instantanées et précises aux questions sur les avantages sociaux, les politiques et les procédures.",
            "technicalLevel": 2,
            "problem": "Un employé de la ville, Jean, veut savoir à combien de jours de congé parental il a droit. Il doit trouver la section RH de l'intranet de la ville, localiser le bon document de politique (qui pourrait être obsolète) et lire des pages de texte juridique pour trouver sa réponse. Incertain, il appelle le service central des RH, où un généraliste RH doit rechercher les mêmes informations pour lui.",
            "value": "Les employés du gouvernement, comme ceux de toute grande organisation, ont des questions fréquentes sur leurs avantages sociaux, leurs régimes de retraite, leurs politiques de vacances et autres procédures internes. Répondre à ces questions répétitives consomme un temps considérable pour les RH et les administrateurs de département. Cette solution fournit un outil en libre-service permettant aux employés d'obtenir des réponses instantanées et précises.",
            "roi": "Le retour sur investissement se mesure en productivité récupérée dans l'ensemble de l'organisation.\nA = Temps moyen économisé par employé par semaine en obtenant des réponses instantanées.\nB = Nombre d'employés dans l'agence.\nC = Coût horaire moyen entièrement chargé d'un employé.\n\n<code>Formule :\nGain de productivité annuel = A * B * 52 * C</code>\n\nExemple : Si vous économisez à chacun de vos 1 000 employés (B) seulement 15 minutes par semaine (A=0,25 heure) à un coût mixte de 40 €/heure (C), vous récupérez 13 000 heures de temps productif et **520 000 € de valeur chaque année**.",
            "implementationGuide": "<h5>Le plan de la solution : une approche purement basée sur l'action générative</h5><p>C'est un cas d'utilisation parfait pour un Copilot de niveau 1 : d'abord l'action générative, en s'appuyant sur une base de connaissances organisée.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Organisez la base de connaissances :</strong> Travaillez avec les RH pour rassembler tous les documents de politique officiels et actuels et placez-les dans une bibliothèque SharePoint dédiée et sécurisée. Assurez-vous qu'il n'y a pas de versions préliminaires ou obsolètes.</li><li><strong>Configurez le Copilot :</strong> Dans Copilot Studio, créez un nouveau Copilot. Sous 'IA générative', ajoutez l'URL de votre base de connaissances SharePoint. Affinez le prompt système : 'Vous êtes un assistant pour les employés de la ville. Vous répondez aux questions en vous basant uniquement sur les documents RH officiels. Ne répondez pas aux questions personnelles et ne donnez pas de conseils financiers. Citez toujours votre document source.'</li><li><strong>Testez et déployez :</strong> Testez minutieusement le Copilot avec un groupe pilote d'employés de différents départements. Posez-lui des questions du monde réel et vérifiez l'exactitude de ses réponses et des liens sources qu'il fournit. Une fois que vous êtes confiant dans ses performances, déployez-le largement via Microsoft Teams pour le rendre facilement accessible à tout le personnel.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Utilisez le Copilot pour lancer des flux de travail. Par exemple, après avoir répondu à une question sur le congé parental, le Copilot pourrait demander : 'Souhaitez-vous demander un congé parental ?' Si l'utilisateur dit oui, il peut déclencher un flux Power Automate qui lance le processus officiel de demande et d'approbation de congé, créant une transition transparente de la collecte d'informations à l'action.</p>"
        },
        {
            "id": 52,
            "title": "Intégration des nouveaux employés",
            "industry": "Secteur public",
            "technology": "Power Automate",
            "miniDescription": "Automatisez et orchestrez l'ensemble de la liste de contrôle d'intégration pour garantir une expérience parfaite dès le premier jour pour chaque nouvelle recrue.",
            "technicalLevel": 6,
            "problem": "Un nouvel urbaniste est embauché. Les RH envoient un e-mail à l'informatique pour créer ses comptes, un autre e-mail aux services généraux pour lui attribuer un bureau, et un troisième au responsable du nouvel employé. Le responsable oublie de demander l'accès à un système de gestion de projet clé, de sorte que le nouvel employé ne peut effectuer aucun travail significatif pendant ses deux premiers jours.",
            "value": "L'intégration d'un nouvel employé dans le secteur public implique une série complexe de tâches dans plusieurs départements : RH, informatique, finances et le département de l'employé lui-même. Un processus manuel entraîne des retards, des étapes manquées et une mauvaise expérience le premier jour pour la nouvelle recrue. Cette solution automatise et orchestre l'ensemble de la liste de contrôle d'intégration.",
            "roi": "Le retour sur investissement se mesure en rétention et en productivité.\n\n<code>Formule :\nValeur = (Valeur de l'augmentation de la rétention) + (Valeur d'une productivité plus rapide)</code>\n\nExemple : Garantit une expérience d'intégration cohérente et professionnelle pour chaque nouvel employé, ce qui est prouvé pour améliorer la rétention à long terme. Réduit le risque d'étapes de sécurité ou de conformité manquées. Libère un temps administratif important pour les RH et les responsables du recrutement. Rend les nouveaux employés productifs plus rapidement.",
            "implementationGuide": "<h5>Le plan de la solution : un flux de travail d'orchestration</h5><p>Il s'agit d'un flux de travail d'orchestration basé sur le temps, géré par Power Automate.</p><h5>Guide de mise en œuvre étape par étape</h5><ol><li><strong>Cartographiez le processus :</strong> Travaillez avec tous les départements concernés pour cartographier le calendrier et la liste de contrôle d'intégration idéaux.</li><li><strong>Créez une liste de suivi :</strong> Dans SharePoint, créez une liste pour enregistrer toutes les tâches d'intégration, avec des colonnes pour le nom de la nouvelle recrue, la description de la tâche, la personne assignée, la date d'échéance et le statut.</li><li><strong>Construisez le flux :</strong> Déclenchez le flux lorsque le formulaire de nouvelle recrue est soumis. Utilisez les actions 'Retarder jusqu'à' pour planifier des tâches pour l'avenir (par exemple, retarder jusqu'à 7 jours avant la date de début). Utilisez les connecteurs pour Planner (Créer une tâche), Outlook (Envoyer un e-mail) et Teams (Publier un message) pour attribuer du travail et envoyer des notifications. Utilisez l'action SharePoint 'Créer un élément' pour enregistrer chaque tâche dans votre liste de suivi.</li></ol><h5>Au-delà des bases (Conseil de pro)</h5><p>Créez un système de parrainage. Dans le cadre du flux, utilisez un prompt AI Builder pour analyser le profil de la nouvelle recrue (département, centres d'intérêt si disponibles) et suggérer 3 'parrains' d'intégration potentiels à partir de l'annuaire des employés. Le responsable peut alors en sélectionner un, et le flux planifie automatiquement une réunion de 30 minutes pour un café d'introduction.</p>"
        }
    ]
}
