
{
    "catalogue": [
        {
            "id": 22,
            "title": "Le Tueur d'Appels n°1 : Comment Automatiser les Demandes de Statut de Commande (WISMO)",
            "industry": "Biens de consommation et de détail",
            "technology": "Copilot Studio & Power Automate",
            "miniDescription": "Construisez un assistant IA qui répond instantanément à la question la plus fréquente des clients - 'Où est ma commande ?' - 24/7.",
            "technicalLevel": 4,
            "problem": "Un client, David, a passé une commande il y a trois jours. Il est impatient de la recevoir. Il se rend sur le site web du détaillant, ne trouve pas facilement de lien de suivi, et ouvre donc un chat en direct. Il attend cinq minutes dans une file d'attente, pour poser à un agent une question qui aurait pu être résolue par une simple recherche dans la base de données. L'expérience est médiocre pour David, et pour l'agent, c'est la 50e requête identique qu'il traite ce jour-là.",
            "value": "Dans le monde du e-commerce, une question règne en maître : 'Où est ma commande ?' (WISMO). Cette seule requête est responsable d'un pourcentage massif de toutes les interactions client. C'est une tâche répétitive à faible valeur qui monopolise vos agents. Ce guide vous montrera comment construire un assistant IA simple mais incroyablement puissant qui répond à cette question instantanément, 24/7.",
            "roi": "Le retour sur investissement d'un bot WISMO est massif, direct et facile à calculer.\nA = Pourcentage de requêtes au centre de contact liées à WISMO (souvent 40-60%).\nB = Volume total mensuel de requêtes au centre de contact.\nC = Coût moyen pour traiter une interaction avec un agent en direct.\n\n<code>Formule :\nÉconomies mensuelles = (A * B) * C</code>\n\nExemple : Si 50% de vos requêtes sont des WISMO (A), que vous traitez 20 000 requêtes par mois (B), et que votre coût par interaction est de 5 €, vous économisez **50 000 € chaque mois**.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Purement Basée sur l'Action Générative</h5><p>C'est le cas d'usage de Niveau 1 par excellence. La tâche principale de l'IA est de comprendre l'intention de l'utilisateur et d'extraire une donnée : le NuméroDeCommande. Un Sujet scénarisé serait fragile et inefficace.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Préparez Votre Fondation (Accès API) :</strong> Vous avez besoin d'un accès API sécurisé en lecture seule à votre système de gestion des commandes (OMS) et à vos principaux transporteurs.</li><li><strong>Construisez le Moteur de Requête (Le Plugin Power Automate) :</strong> Dans Power Automate, créez un nouveau flux déclenché par 'Exécuter depuis Copilot'. <ul ><li><strong>Nom du Plugin :</strong> Obtenir le statut et le suivi de la commande</li><li><strong>Description pour l'IA :</strong> 'Obtient le statut d'expédition en temps réel et un lien de suivi pour la commande d'un client. Nécessite le numéro de commande.'</li><li><strong>Entrées :</strong> Définissez une seule entrée de texte : NuméroDeCommande.</li><li><strong>Logique du Flux :</strong> Appelez l'API de votre OMS. Analysez la réponse pour obtenir le Statut et le NuméroDeSuivi. Formatez une chaîne de texte claire et renvoyez-la au Copilot.</li></ul></li><li><strong>Activez le Plugin dans Copilot Studio :</strong> Naviguez simplement vers la section Plugins, trouvez votre nouveau plugin et activez-le.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Éliminez la requête avant même qu'elle ne soit posée avec des notifications proactives. Créez un flux Power Automate planifié distinct qui s'exécute toutes les quelques heures. Ce flux devrait obtenir une liste de toutes les commandes actuellement 'en transit'. Pour chacune, il appelle l'API du transporteur. Si le statut de suivi a changé, le flux envoie automatiquement une mise à jour par e-mail ou SMS au client.</p>"
        },
        {
            "id": 23,
            "title": "Le Retour Sans Friction : Fidéliser en Automatisant les RMA",
            "industry": "Biens de consommation et de détail",
            "technology": "Copilot Studio & Power Automate",
            "miniDescription": "Transformez un processus de retour frustrant en une expérience de fidélisation avec un système RMA guidé et automatisé.",
            "technicalLevel": 7,
            "problem": "Une cliente, Sarah, a acheté une chemise en ligne, mais ce n'est pas la bonne taille. Elle se rend sur le site web du détaillant et doit chercher la page de la politique de retour. Elle doit ensuite remplir un formulaire web déroutant, imprimer une étiquette et trouver son propre emballage. Tout le processus ressemble à une punition. Frustrée, elle jure de ne plus jamais acheter là-bas.",
            "value": "Dans le e-commerce, l'expérience de retour d'un client est tout aussi importante que son expérience d'achat. Un processus de retour difficile peut briser une relation, tandis qu'un processus fluide peut transformer un client insatisfait en un défenseur fidèle. Ce guide vous montrera comment construire un système de retour automatisé qui offre une expérience client de premier ordre tout en rationalisant vos opérations de logistique inverse.",
            "roi": "Le retour se mesure en fidélité client, en efficacité opérationnelle et en réduction des contacts de service.\nA = Réduction des contacts au service client liés aux retours.\nB = Augmentation de la valeur à vie du client (LTV) grâce à une meilleure satisfaction.\nC = Temps économisé par le personnel de l'entrepôt.\n\n<code>Formule :\nProposition de Valeur = (Économies sur les Contacts, A) + (Augmentation de la LTV, B) + (Économies Opérationnelles, C)</code>\n\nExemple : Un processus de retour sans friction est un moteur clé des achats répétés. Les études montrent que plus de 90% des clients achèteront à nouveau chez un détaillant qui offre un processus de retour facile. Cette augmentation de la fidélité (B) est le principal moteur financier.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Hybride</h5><p>Le processus de retour nécessite une saisie structurée et axée sur des politiques, suivie d'une série d'actions backend. Une demande de retour doit être validée par rapport aux règles métier. Un <strong>Sujet</strong> guidé est la meilleure façon de guider le client. Les actions ultérieures sont une orchestration complexe, idéale pour un <strong>plugin Power Automate</strong> robuste.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Préparez Votre Fondation (Logique de Politique & API Transporteur) :</strong> Votre système de gestion des commandes doit contenir les règles métier pour les retours. Vous avez également besoin d'un accès API à votre transporteur pour générer des étiquettes.</li><li><strong>Construisez la Conversation Guidée (Le Sujet) :</strong> Dans Copilot Studio, créez le Sujet 'Démarrer ou Gérer un Retour'. Demandez le numéro de commande, puis affichez les articles de cette commande sous forme de boutons sélectionnables.</li><li><strong>Créez le Moteur d'Orchestration (Le Plugin Power Automate) :</strong> Créez un flux déclenché par 'Exécuter depuis Copilot' et configurez-le comme un plugin. <ul ><li><strong>Logique du Flux :</strong> Appelez l'API de votre OMS pour valider si l'article est éligible au retour. Si oui, appelez l'API du transporteur pour générer une étiquette d'expédition. Mettez à jour le statut de la commande dans l'OMS. Renvoyez l'étiquette à l'utilisateur via le Copilot.</li></ul></li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Automatisez le processus de remboursement. Créez un flux Power Automate distinct qui se déclenche lorsqu'un colis arrive à votre entrepôt et que l'étiquette de retour est scannée. Cet événement peut être envoyé depuis votre système de gestion d'entrepôt (WMS) via un webhook. Le flux déclenche alors automatiquement le remboursement et envoie au client une notification finale 'Votre retour est terminé'.</p>"
        }
    ]
}
