
{
    "catalogue": [
        {
            "id": 38,
            "title": "Le Concierge Numérique : Service Client IA pour les Télécoms",
            "industry": "Télécom",
            "technology": "Copilot Studio & Power Automate",
            "miniDescription": "Déployez un concierge numérique IA qui fournit des réponses instantanées aux questions courantes et gère des tâches transactionnelles comme le paiement de factures.",
            "technicalLevel": 6,
            "problem": "Une cliente, Sarah, veut savoir combien de données il lui reste sur son forfait mobile. Elle appelle le service client, navigue dans un menu SVI complexe et attend 10 minutes, pour poser une question qui aurait pu être résolue par une simple consultation de compte. L'expérience est frustrante pour Sarah et coûteuse pour le fournisseur.",
            "value": "Les centres de contact des télécoms sont inondés de requêtes à fort volume et faible complexité. Cela augmente les coûts opérationnels et empêche les agents de se concentrer sur des interactions à plus forte valeur. Ce guide montre comment construire un concierge numérique qui détourne ces requêtes courantes et offre une expérience client supérieure.",
            "roi": "A = Nombre d'appels détournés du centre de contact par mois.\nB = Coût moyen pour traiter un appel d'agent en direct.\n\n<code>Formule :\nÉconomies Mensuelles = A * B</code>\n\nExemple : Si le Copilot détourne 100 000 appels par mois (A) à un coût moyen de 7 $ par appel (B), les économies opérationnelles directes sont de 700 000 $ par mois. Cela améliore également la satisfaction client.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Hybride de Niveau 1 & 2</h5><p>Cette solution combine la puissance des Réponses Génératives pour les requêtes informationnelles avec des Sujets structurés et des plugins Power Automate pour les tâches transactionnelles.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Construisez la Base de Connaissances :</strong> Créez un site SharePoint avec tous vos articles d'aide publics. Dans Copilot Studio, pointez la fonction d'IA Générative vers cette URL.</li><li><strong>Construisez des Plugins Transactionnels :</strong> Pour des actions comme 'Payer ma facture', créez des flux Power Automate qui se connectent à vos systèmes de facturation et CRM via une API.</li><li><strong>Implémentez l'Authentification :</strong> Pour effectuer des actions spécifiques au compte, configurez l'authentification de l'utilisateur dans votre Copilot.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Créez un moteur de communication proactif. Utilisez un flux Power Automate planifié pour identifier les clients qui approchent de leur limite de données. Le flux peut alors envoyer une notification proactive : 'Bonjour Sarah, vous avez utilisé 90% de vos données. Souhaitez-vous ajouter 5 Go pour 10 $ ?' avec une confirmation en un clic.</p>"
        },
        {
            "id": 39,
            "title": "Dispatch des Techniciens sur le Terrain",
            "industry": "Télécom",
            "technology": "Power Automate",
            "miniDescription": "Automatisez le flux de travail de dispatch pour envoyer le bon technicien au bon endroit avec les bonnes informations, plus rapidement.",
            "technicalLevel": 7,
            "problem": "Un agent du service client détermine que le problème d'un client nécessite une visite technique. L'agent doit créer manuellement un ordre de travail dans un système distinct, puis consulter une feuille de calcul pour voir quels techniciens sont disponibles, et enfin appeler le technicien. Le processus est lent et inefficace.",
            "value": "Lorsqu'un problème client ne peut être résolu à distance, un technicien doit être envoyé. Ce processus implique la création d'un ordre de travail, la recherche du bon technicien et la planification de la visite. Cette automatisation rationalise l'ensemble du flux de travail.",
            "roi": "Le ROI se mesure en efficacité opérationnelle et en satisfaction client.\nA = Réduction du temps de dispatch d'un technicien (en minutes).\nB = Nombre de dispatches par mois.\nC = Augmentation du taux de résolution au premier contact.\n\n<code>Formule :\nValeur = (Temps Économisé + Efficacité Améliorée)</code>\n\nExemple : Réduire le temps de dispatch de 15 minutes (A) sur 2 000 dispatches (B) économise 500 heures de temps administratif par mois. Une augmentation de 5% du taux de résolution au premier contact (C) réduit les visites répétées coûteuses.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail Backend</h5><p>Ce flux de travail est déclenché à la fin du processus de dépannage.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Intégration Système :</strong>  Cette solution nécessite un système de gestion de service sur le terrain moderne (comme Dynamics 365) qui suit l'emplacement, les compétences et les horaires des techniciens.</li><li><strong>Construisez le Flux :</strong> Déclenchez le flux à partir d'un bouton Power App. Utilisez l'action 'Créer une nouvelle ligne' pour créer l'ordre de travail. Utilisez l'action 'Lister les lignes' avec des requêtes de filtre avancées pour trouver les techniciens disponibles. Utilisez 'Mettre à jour une ligne' pour assigner l'ordre de travail.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Automatisez la communication client. Une fois l'ordre de travail assigné, le flux peut automatiquement envoyer un SMS au client : 'Votre technicien, David, est confirmé pour votre rendez-vous demain entre 14h et 16h.' Cela tient le client informé.</p>"
        },
        {
            "id": 40,
            "title": "Communication Proactive sur les Pannes",
            "industry": "Télécom",
            "technology": "Power Automate",
            "miniDescription": "Informez automatiquement les clients concernés dès qu'une panne de service est détectée, transformant un événement négatif en une expérience client positive.",
            "technicalLevel": 8,
            "problem": "Une panne de réseau affecte un quartier. La première indication du problème pour l'entreprise de télécommunications est lorsque son centre d'appels est soudainement inondé de centaines d'appels de clients en colère. Les agents n'ont aucune information à leur donner.",
            "value": "Lorsqu'une panne de service se produit, la meilleure façon de gérer la frustration des clients est une communication proactive. Au lieu d'attendre que les clients appellent, cette solution informe automatiquement les clients concernés dès qu'une panne est détectée.",
            "roi": "Le ROI se mesure en déviation d'appels et en satisfaction client améliorée.\nA = Nombre d'appels entrants évités lors d'une panne.\nB = Coût par appel.\n\n<code>Formule :\nÉconomies par Panne = A * B</code>\n\nExemple : Éviter 5 000 appels (A) à un coût de 7 $ par appel (B) économise 35 000 $ pour un seul événement de panne majeur. L'amélioration de la perception de la marque est inestimable.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail Piloté par les Événements</h5><p>Il s'agit d'un flux de travail proactif et piloté par les événements, alimenté par Power Automate.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Déclencheur API :</strong> La clé est la capacité de votre système de surveillance de réseau à déclencher le flux, généralement via un webhook.</li><li><strong>Intégration CRM :</strong> Vous avez besoin d'un accès fiable à votre CRM pour obtenir une liste de clients en fonction de leur adresse de service.</li><li><strong>Construisez le Flux :</strong> Utilisez le déclencheur de requête HTTP. Utilisez une action 'Lister les lignes' sur votre base de données clients, en filtrant par les données de localisation. Utilisez une boucle 'Apply to each' pour parcourir les clients concernés et leur envoyer un SMS ou un e-mail.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Créez un service d'abonnement en libre-service. Permettez aux clients de s'inscrire pour recevoir des notifications de panne pour plusieurs adresses (par exemple, leur domicile et celui de leurs parents âgés). Ces données sont stockées dans une liste que le flux de panne proactif peut interroger.</p>"
        },
        {
            "id": 57,
            "title": "Activation de Nouvelles Offres de Service",
            "industry": "Télécom",
            "technology": "Power Automate",
            "miniDescription": "Assurez le déploiement cohérent et efficace des nouvelles offres de service avec un flux de travail automatisé.",
            "technicalLevel": 6,
            "problem": "Une entreprise de télécommunications lance 'Fibre 1000', un nouveau forfait internet gigabit. Le chef de produit envoie un e-mail de masse. Le service de formation doit créer de nouveaux supports, le système de facturation doit être mis à jour, et le système de provisionnement a besoin du nouveau code de service. La coordination manuelle est chaotique.",
            "value": "Lorsqu'une entreprise de télécommunications lance un nouveau service, des milliers d'agents du service client doivent être formés et plusieurs systèmes backend doivent être mis à jour. Ce flux de travail automatisé garantit que les nouvelles offres sont déployées de manière cohérente et efficace.",
            "roi": "Le ROI se mesure en accélération des revenus et en excellence opérationnelle.\n\n<code>Formule :\nValeur = (Revenus d'un Lancement à Temps) + (Coût des Erreurs Évitées)</code>\n\nExemple : Assure des lancements fluides et coordonnés pour les nouveaux services. Prévient les problèmes de service client causés par des informations incohérentes. Réduit la charge de gestion de projet manuelle.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail d'Orchestration</h5><p>Il s'agit d'un flux de travail d'orchestration qui garantit que tous les départements sont prêts pour le lancement d'un nouveau service.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Construisez la Power App :</strong> Créez un formulaire complet pour que les chefs de produit définissent tous les aspects d'un nouveau service.</li><li><strong>Construisez le Flux :</strong> Déclenchez le flux depuis la Power App. Utilisez un contrôle de branche parallèle pour créer et assigner des tâches aux différents départements simultanément. Utilisez une Condition qui vérifie si toutes les tâches sont terminées avant de continuer. Utilisez une action finale pour l'annonce du jour du lancement.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Automatisez la base de connaissances. Dans le cadre du flux de travail, utilisez un prompt AI Builder pour générer un 'Brief de Service' concis. Au lancement du service, le flux peut automatiquement ajouter ce brief à la base de connaissances du Copilot du service client, assurant que l'assistant IA est prêt à répondre aux questions.</p>"
        },
        {
            "id": 58,
            "title": "Bot de Dépannage pour le Service Client",
            "industry": "Télécom",
            "technology": "Copilot Studio & Power Automate",
            "miniDescription": "Fournissez un agent automatisé 24/7 capable de résoudre les problèmes techniques les plus courants, libérant ainsi les agents humains pour des problèmes plus complexes.",
            "technicalLevel": 7,
            "problem": "La connexion Internet d'un client cesse de fonctionner. Il appelle la ligne d'assistance et attend 15 minutes, pour que l'agent lui fasse suivre l'étape de dépannage la plus basique : 'Avez-vous essayé de l'éteindre et de le rallumer ?' C'est une expérience frustrante pour le client et une utilisation inefficace du temps de l'agent.",
            "value": "La grande majorité des appels au service client des entreprises de télécommunications concernent des problèmes techniques simples et répétitifs. Cette solution fournit un agent automatisé 24/7 capable de résoudre les problèmes les plus courants, libérant ainsi les agents humains pour des problèmes plus complexes.",
            "roi": "Le ROI se mesure en économies de coûts directes.\nA = Temps de traitement moyen d'un agent en direct pour un appel de dépannage simple (en minutes).\nB = Nombre d'appels de dépannage simples par mois.\nC = Coût par minute d'un agent de centre de contact.\n\n<code>Formule :\nÉconomies Mensuelles = A * B * C</code>\n\nExemple : Si un appel simple prend 8 minutes (A), et que le bot détourne 50 000 de ces appels par mois (B) à un coût d'agent de 0,75 $/minute (C), les économies mensuelles sont de 300 000 $. Cela améliore également considérablement la satisfaction des clients.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Approche Hybride de Niveau 2</h5><p>Il utilise un Sujet guidé et scénarisé pour le dépannage, mais avec un plugin Power Automate pour interagir avec les systèmes réseau en direct.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Accès API :</strong> Vous devez disposer d'une API permettant à Power Automate d'initier un test de ligne ou d'interroger l'état de la connexion d'un client.</li><li><strong>Construisez le Sujet du Copilot :</strong> Dans Copilot Studio, créez un nouveau Sujet appelé 'Dépannage Internet'. La première étape doit être un nœud de Question pour obtenir le numéro de compte du client. Ajoutez un nœud d'Action pour appeler votre plugin Power Automate. Utilisez un nœud de Condition pour vérifier le résultat du plugin.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Soyez proactif. Créez un flux Power Automate planifié qui s'exécute toutes les heures et interroge le système de gestion de réseau pour toute nouvelle panne de zone. Si une panne est détectée, le flux peut utiliser un prompt AI Builder pour générer un résumé clair et lisible de la panne et mettre à jour de manière proactive le message d'accueil du Copilot.</p>"
        },
        {
            "id": 65,
            "title": "Demande d'Accès au Site de Cellule Réseau",
            "industry": "Télécom",
            "technology": "Power Automate",
            "miniDescription": "Numérisez le flux de travail pour demander et approuver l'accès aux installations réseau sécurisées, garantissant une surveillance complète de la sécurité et une auditabilité.",
            "technicalLevel": 6,
            "problem": "Un sous-traitant de maintenance tiers a besoin d'accéder à un site cellulaire pour effectuer une mise à niveau d'équipement. Il doit envoyer un e-mail au centre d'opérations réseau (NOC), qui doit ensuite obtenir l'approbation du responsable de la sécurité du site et du chef des opérations régionales avant de pouvoir émettre un code d'accès temporaire. La chaîne d'e-mails et les retards peuvent reporter une maintenance critique.",
            "value": "L'accès physique à une installation réseau sécurisée comme une tour de téléphonie mobile ou un centre de données nécessite un processus formel de demande et d'approbation impliquant plusieurs équipes. Cette automatisation numérise le flux de travail, garantissant un accès rapide mais avec une surveillance complète de la sécurité.",
            "roi": "Le ROI se mesure en sécurité et en vitesse opérationnelle.\n\n<code>Formule :\nValeur = (Valeur de la Réduction des Temps d'Arrêt du Réseau) + (Valeur de la Conformité en Matière de Sécurité)</code>\n\nExemple : Applique les protocoles de sécurité avec une cohérence de 100 %. Fournit un enregistrement complet et auditable. Accélère l'accès pour les travaux de maintenance légitimes, réduisant ainsi les temps d'arrêt du réseau.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail d'Approbation à Plusieurs Niveaux</h5><p>Il s'agit d'un flux de travail d'approbation à plusieurs niveaux, similaire au cas d'utilisation de l'Accès au Laboratoire (#43).</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Accès API :</strong> L'intégration avec le système de contrôle d'accès du site (pour générer des codes) est hautement souhaitable.</li><li><strong>Construisez le Flux :</strong> Déclenchez à partir d'une Power App ou d'un formulaire. Utilisez une série d'actions imbriquées 'Démarrer et attendre une approbation' pour gérer les approbations séquentielles. Dans la branche d'approbation finale, utilisez une action HTTP pour appeler l'API du système de sécurité afin de générer le code d'accès.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Intégrez une fonctionnalité de 'check-in/check-out'. Lorsque le technicien arrive sur le site, il peut utiliser la Power App pour scanner un code QR à la porte pour s'enregistrer. Cela déclenche un flux qui informe le NOC. Lorsqu'il repart, il scanne à nouveau pour se déconnecter, ce qui déclenche un flux qui confirme la fin des travaux.</p>"
        }
    ]
}
