
{
    "catalogue": [
        {
            "id": 66,
            "title": "Signalement de Défaut de Compteur Intelligent",
            "industry": "Services publics",
            "technology": "Power Automate",
            "miniDescription": "Automatisez le processus de réception des signaux de défaut des compteurs intelligents, de diagnostic du problème avec l'IA et de création d'un ordre de travail.",
            "technicalLevel": 8,
            "problem": "Un compteur d'électricité intelligent détecte un défaut interne. Il envoie un code de diagnostic à un serveur central, où il reste dans un fichier journal jusqu'à ce qu'un analyste l'examine le lendemain matin. Le client n'est pas conscient du problème jusqu'à ce que son courant soit coupé.",
            "value": "Avec le déploiement des compteurs intelligents, les entreprises de services publics peuvent désormais recevoir des signaux de défaut automatisés directement du terrain. Cette solution automatise le processus de réception de ces signaux, de diagnostic du problème et de création d'un ordre de travail, transformant les données brutes en une réponse exploitable.",
            "roi": "Le ROI se mesure en maintenance proactive et en fiabilité améliorée.\n\n<code>Formule :\nValeur = (Coût d'une Panne Évitée * Nombre de Pannes Évitées) + (Heures de Surveillance Manuelle Économisées * Coût Horaire)</code>\n\nExemple : Permet une maintenance proactive, permettant à l'utilitaire de résoudre les problèmes avant qu'ils ne provoquent une interruption de service pour le client. Améliore la fiabilité du réseau et la satisfaction des clients. Réduit le besoin de surveillance manuelle des journaux de défauts.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail Piloté par les Événements</h5><p>Il s'agit d'un flux de travail piloté par les événements, déclenché par un appareil IoT.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Intégration IoT :</strong> Vous avez besoin d'un Azure IoT Hub pour recevoir les messages des compteurs intelligents, et d'un connecteur Power Automate pour IoT Hub.</li><li><strong>Construisez le Flux :</strong> Utilisez le déclencheur 'Lorsqu'un nouveau message est reçu dans un IoT Hub'. Utilisez une action 'Analyser le JSON' pour extraire les données du message. Utilisez un contrôle 'Switch' sur la propriété 'Code de Défaut'. Dans chaque cas, ajoutez l'action appropriée : Créer une tâche, Mettre à jour une ligne (pour le CRM) ou Créer un ordre de travail (pour le système de service sur le terrain).</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Prédisez les pannes avant qu'elles ne se produisent. Au lieu de simplement réagir aux codes de défaut, collectez toutes les données de diagnostic des compteurs au fil du temps. Utilisez ces données pour entraîner un modèle de Prédiction AI Builder afin d'identifier les schémas qui précèdent une défaillance. Le flux peut alors s'exécuter quotidiennement sur tous les compteurs et, si le modèle prédit une forte probabilité de panne pour un compteur spécifique dans les 30 prochains jours, il peut planifier un remplacement de manière proactive, créant un système de maintenance véritablement intelligent.</p>"
        },
        {
            "id": 67,
            "title": "Demande de Nouveau Raccordement de Service",
            "industry": "Services publics",
            "technology": "Power Automate",
            "miniDescription": "Numérisez et automatisez l'ensemble du flux de travail de nouveau raccordement de service, de la demande et de la vérification de crédit à la création de compte et au dispatch.",
            "technicalLevel": 7,
            "problem": "Un nouveau propriétaire appelle la compagnie de services publics pour installer son service d'électricité. L'agent prend ses coordonnées par téléphone, puis remplit un formulaire interne. Ce formulaire va au service de crédit pour une vérification de dépôt, puis à l'équipe de dispatch pour planifier un technicien pour lire le compteur. Le processus prend plusieurs jours.",
            "value": "Lorsqu'un client emménage dans une nouvelle propriété, il a besoin que son service d'électricité, de gaz ou d'eau soit raccordé. Ce processus implique souvent de la paperasse manuelle et une coordination entre le service client, les finances et les opérations sur le terrain. Cette solution numérise et automatise l'ensemble du flux de travail de nouveau raccordement.",
            "roi": "Le ROI se mesure en expérience client et en efficacité.\n\n<code>Formule :\nValeur = (Heures Administratives Économisées * Coût Horaire) + (Valeur de l'Expérience Client Améliorée)</code>\n\nExemple : Offre une expérience numérique et en libre-service moderne aux nouveaux clients. Réduit la charge de travail administrative des agents du service client. Accélère le processus de nouveau raccordement de plusieurs jours à quelques minutes. Garantit l'exactitude des données en éliminant la saisie manuelle.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail Piloté par un Portail</h5><p>Cette solution combine un portail orienté client avec un flux de travail backend.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Construisez le Portail :</strong> Créez un site Power Pages convivial pour les nouvelles demandes de service.</li><li><strong>Intégration API :</strong> Vous aurez besoin d'un accès API à un service de vérification de crédit, ainsi qu'à vos systèmes CRM et de service sur le terrain.</li><li><strong>Construisez le Flux :</strong> Déclenchez à partir de la soumission du formulaire Power Pages. Utilisez une action HTTP pour appeler l'API du bureau de crédit. Utilisez une 'Condition' pour vérifier le score de crédit et déterminer le montant du dépôt. Utilisez les actions 'Créer une nouvelle ligne' pour créer le compte client et l'ordre de travail. Utilisez 'Envoyer un e-mail (V2)' pour envoyer la confirmation finale au client.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Offrez un package 'emménagement'. Dans le cadre du flux de travail, associez-vous à des entreprises locales de télécommunications ou d'assurance. Le flux peut utiliser un prompt AI Builder pour générer une offre personnalisée en fonction de la nouvelle adresse du client. L'e-mail de confirmation pourrait inclure cette offre exclusive en un clic : 'En tant que nouveau résident, bénéficiez de 20% de réduction sur votre première année d'internet à domicile de notre partenaire, TelcoSwiss.'</p>"
        },
        {
            "id": 68,
            "title": "Création d'Ordres de Travail pour la Gestion de la Végétation",
            "industry": "Services publics",
            "technology": "Power Automate",
            "miniDescription": "Utilisez l'IA pour analyser l'imagerie aérienne, identifier automatiquement la végétation empiétant sur les lignes électriques et créer des ordres de travail pour les équipes d'élagage.",
            "technicalLevel": 9,
            "problem": "Une compagnie de services publics s'appuie sur des inspections manuelles et périodiques pour trouver les arbres qui poussent trop près des lignes électriques. Un inspecteur parcourt des centaines de kilomètres de lignes et note les emplacements. C'est lent, coûteux, et un arbre à croissance rapide peut provoquer une panne entre les cycles d'inspection.",
            "value": "Les services publics dotés d'infrastructures étendues, comme les lignes électriques et les pipelines, doivent constamment gérer la végétation (par exemple, l'élagage des arbres) pour prévenir les pannes et garantir la sécurité. Ce processus implique l'identification des dangers potentiels et l'envoi d'équipes pour effectuer le travail. Cette solution utilise l'IA pour automatiser l'identification et la création d'ordres de travail.",
            "roi": "Le ROI se mesure en réduction des risques et en efficacité opérationnelle.\n\n<code>Formule :\nValeur = (Coût d'une Panne Majeure Évitée) + (Économies sur les Coûts d'Inspection)</code>\n\nExemple : Un seul incendie de forêt ou une panne majeure causée par un arbre tombant sur une ligne peut coûter des millions. Cette solution offre un moyen plus efficace, complet et proactif de gérer ce risque critique. Elle réduit les coûts d'inspection manuelle et permet aux équipes de se concentrer uniquement sur les endroits qui nécessitent réellement des travaux.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail Proactif Alimenté par l'IA</h5><p>Il s'agit d'une solution de maintenance proactive alimentée par l'analyse IA de l'imagerie aérienne.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Entraînez le Modèle IA :</strong> C'est l'étape clé. Vous devrez créer un modèle de vision personnalisé et l'entraîner avec des centaines d'images étiquetées, lui montrant des exemples de scénarios 'sûrs' et 'd'empiètement'.</li><li><strong>Construisez le Flux :</strong> Déclenchez le flux 'Lorsqu'un blob est ajouté ou modifié' dans Azure Blob Storage. Ajoutez une action pour appeler votre modèle de vision personnalisé avec la nouvelle image. Utilisez une 'Condition' pour vérifier si la prédiction du modèle est 'empiètement'. Si oui, utilisez l'action 'Créer une nouvelle ligne' pour créer l'ordre de travail dans votre système de service sur le terrain, en mappant les données GPS et autres détails.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Priorisez le travail. Améliorez le modèle IA pour non seulement identifier un empiètement, mais aussi pour classifier sa gravité (par exemple, Faible, Moyenne, Élevée) en fonction du type d'arbre et de sa proximité. Le flux Power Automate peut alors utiliser cette évaluation de la gravité pour définir automatiquement la priorité de l'ordre de travail, garantissant que les situations les plus dangereuses sont traitées en premier.</p>"
        },
        {
            "id": 69,
            "title": "Vérification de Conformité Pré-Négociation pour le Trading d'Énergie",
            "industry": "Services publics",
            "technology": "Power Automate",
            "miniDescription": "Fournissez une vérification de conformité pré-négociation instantanée et automatisée pour les traders d'énergie, garantissant que toutes les transactions respectent les limites réglementaires et de risque internes.",
            "technicalLevel": 8,
            "problem": "Un trader d'énergie à Genève veut exécuter une importante transaction de gaz naturel. Avant de pouvoir cliquer sur 'acheter', il doit appeler son responsable de la conformité pour confirmer verbalement que la transaction ne dépassera pas les limites d'exposition de l'entreprise. Le retard pourrait lui faire manquer le prix idéal du marché.",
            "value": "Dans le monde rapide du trading d'énergie, chaque transaction doit être vérifiée par rapport à un ensemble complexe de limites réglementaires et de politiques de risque internes avant de pouvoir être exécutée. Une vérification manuelle est trop lente et risque des violations de conformité coûteuses. Cette solution fournit une vérification de conformité pré-négociation instantanée et automatisée.",
            "roi": "Le ROI se mesure en atténuation des risques et en performance de trading.\n\n<code>Formule :\nValeur = (Valeur des Amendes/Pertes Évitées) + (Valeur d'une Exécution de Transaction plus Rapide)</code>\n\nExemple : Le ROI principal est l'atténuation des risques. Il prévient les amendes de conformité coûteuses et les pertes de trading dues à des transactions non autorisées. Le ROI secondaire est l'amélioration de la performance de trading ; en fournissant des vérifications instantanées, il permet aux traders d'agir plus rapidement sur les opportunités de marché.",
            "implementationGuide": "<h5>Le Plan de la Solution : Un Flux de Travail en Temps Réel, Axé sur les Données</h5><p>Il s'agit d'un flux de travail en temps réel, axé sur les données, intégré directement dans la boîte à outils du trader.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Centralisation des Données :</strong> La clé est d'avoir toutes les données de risque et de limite disponibles dans des bases de données que Power Automate peut interroger rapidement (par exemple, Azure SQL).</li><li><strong>Construisez la Power App :</strong> Créez une interface simple, rapide et claire pour les traders.</li><li><strong>Construisez le Flux :</strong> Déclenchez le flux depuis la Power App. Utilisez un contrôle de branche parallèle pour exécuter toutes les vérifications de conformité simultanément. Utilisez les actions 'Obtenir des éléments' ou 'Exécuter une requête SQL'. Utilisez une série de contrôles 'Condition' pour évaluer les résultats. Utilisez l'action 'Répondre à une PowerApp ou un flux' pour renvoyer le résultat final.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Analyse 'what-if'. Ajoutez une fonctionnalité à la Power App qui permet à un trader de voir à quel point il est proche de ses limites. Le flux pourrait renvoyer non seulement un statut 'Clair', mais aussi la marge de manœuvre restante sur ses principales limites. Cela lui permet de mieux gérer son risque tout au long de la journée de trading.</p>"
        },
        {
            "id": 70,
            "title": "Détection d'Anomalies sur les Factures de Services Publics",
            "industry": "Services publics",
            "technology": "Power Automate",
            "miniDescription": "Utilisez l'IA pour surveiller de manière proactive les factures des clients, signaler les anomalies qui pourraient indiquer des problèmes comme des fuites ou des équipements défectueux, et informer les gestionnaires de comptes.",
            "technicalLevel": 7,
            "problem": "Une grande usine de fabrication reçoit sa facture d'électricité mensuelle, et elle est 50% plus élevée que d'habitude. Ils ne remarquent le problème qu'après le paiement de la facture. On découvre plus tard qu'une grosse machine fonctionnait mal et consommait un excès d'énergie pendant des semaines, coûtant des dizaines de milliers d'Euros à l'entreprise.",
            "value": "Les grands clients industriels ou commerciaux d'un service public peuvent recevoir des factures de plusieurs centaines de milliers d'Euros. Une augmentation soudaine et inattendue d'une facture peut indiquer un problème grave. Cette solution utilise l'IA pour surveiller de manière proactive les factures des clients et signaler les anomalies pour enquête.",
            "roi": "Le ROI se mesure en rétention de la clientèle et en service à valeur ajoutée.\n\n<code>Formule :\nValeur = (Valeur de la Rétention Client) + (Coût du Problème Évité pour le Client)</code>\n\nExemple : C'est un puissant service de rétention de la clientèle et à valeur ajoutée. En alertant de manière proactive les clients sur les problèmes potentiels sur leurs sites, le service public se transforme d'un simple fournisseur de produits de base en un partenaire de gestion de l'énergie de confiance. Cela peut améliorer considérablement les relations avec les clients à haute valeur.",
            "implementationGuide": "<h5>Le Plan de la Solution : Une Solution de Surveillance Proactive Pilotée par l'IA</h5><p>Il s'agit d'une solution de surveillance proactive et pilotée par l'IA.</p><h5>Guide de Mise en Œuvre</h5><ol><li><strong>Modèle IA :</strong> Le modèle de détection d'anomalies dans AI Builder est pré-construit et prêt à l'emploi. Il vous suffit de lui fournir des données de séries chronologiques.</li><li><strong>Données Historiques :</strong> Vous avez besoin d'un accès à au moins 12-24 mois de données de consommation historiques pour chaque client afin de fournir un contexte au modèle IA.</li><li><strong>Construisez le Flux :</strong> Créez un flux cloud planifié. Utilisez des actions pour obtenir la liste des principaux clients et leurs données historiques. Parcourez chaque client. À l'intérieur de la boucle, utilisez l'action AI Builder 'Détecter les anomalies'. Utilisez une 'Condition' pour vérifier si le résultat est_anomalie est vrai. Si c'est le cas, créez une tâche dans votre CRM et assignez-la au gestionnaire de compte.</li></ol><h5>Au-delà des Bases (Conseil de Pro)</h5><p>Fournissez un libre-service client. Intégrez les résultats de la détection d'anomalies dans le portail en ligne du client. Permettez-leur de voir leurs propres données de consommation et de configurer leurs propres alertes. Par exemple, un client pourrait configurer une règle : 'Si ma consommation d'eau hebdomadaire est 20% plus élevée que la semaine précédente, envoyez un SMS à mon responsable des installations.'</p>"
        }
    ]
}
