{
    "catalogue": [
       { "id": 1, "title": "De semaines en heures : une approche moderne de l'intégration des clients", "industry": "Services financiers et bancaires", "technology": "Copilot Studio & Power Automate", "miniDescription": "Automatisez l'ensemble du parcours d'intégration des clients, de la collecte de documents et des vérifications KYC/AML à l'approbation finale, réduisant ainsi les frictions et les risques de conformité.", "technicalLevel": 7, "problem": "Voici Stefan, un responsable de la conformité dans une banque privée. Sa quête quotidienne consiste à déchiffrer des formulaires manuscrits, à relancer les clients pour des documents manquants et à recouper manuellement les noms avec des listes de sanctions. Le processus pour un seul client peut prendre des semaines. Une simple faute de frappe pourrait entraîner un échec d'audit, et un retard dans l'intégration pourrait signifier la perte d'un client. Stefan a besoin de plus qu'une simple automatisation ; il a besoin d'un système intelligent qui gère le travail répétitif afin qu'il puisse se concentrer sur une véritable analyse des risques.", "value": "Dans le monde à enjeux élevés des services financiers, le processus d'intégration des clients est la première poignée de main, la plus critique. Pourtant, pour de nombreuses institutions, c'est un parcours semé d'embûches avec des montagnes de paperasse, des contrôles de conformité périlleux (KYC/AML) et le risque constant d'erreurs manuelles. Cette friction crée non seulement une mauvaise première impression, mais ouvre également la porte à un risque de conformité important. Cette solution automatise les tâches fastidieuses, ravit les nouveaux clients et crée un processus de conformité robuste et vérifiable.", "roi": "Le cas d'affaires pour cette solution hybride est exceptionnellement solide.\nA = Temps moyen pour intégrer manuellement un client (en heures).\nB = Nombre de nouveaux clients intégrés par mois.\nC = Coût horaire moyen chargé d'un employé de la conformité/des opérations.\n\n<code>Formule :\nHeures mensuelles économisées = (A * B)\nÉconomies mensuelles = Heures mensuelles économisées * C</code>\n\nExemple : Si l'intégration manuelle prend 8 heures (A), que vous intégrez 50 clients par mois (B) et que le coût de votre personnel est de 60 €/heure (C), vous économisez **400 heures** et **24 000 € chaque mois**. Ce retour sur investissement ne tient même pas compte de l'immense valeur de la réduction du risque de conformité et de l'accélération des revenus.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le plan de la solution : une approche hybride</h5><p class=\"mb-4 text-gray-600\">Ce cas d'utilisation est un parfait exemple où une architecture hybride réfléchie offre le plus de valeur. Le processus principal orienté client nécessite une conversation structurée et guidée pour garantir que chaque donnée de conformité obligatoire est capturée dans le bon ordre. Nous ne pouvons pas risquer qu'un client manque une étape. Par conséquent, un <strong>Sujet</strong> traditionnel est le choix idéal pour l'interaction avec l'utilisateur. Cependant, le traitement en arrière-plan - le « gros du travail » - sera construit comme un <strong>plugin d'Action Générative</strong> intelligent et réutilisable, rendant notre solution à la fois robuste et évolutive.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de mise en œuvre étape par étape</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Préparez votre fondation (Dataverse) :</strong> Pour une solution d'entreprise, Microsoft Dataverse est la fondation idéale. Créez une table nommée \"Cas d'intégration\" avec des colonnes pour le nom du client, l'e-mail, la date de naissance, le statut KYC, le résultat de la vérification AML et une colonne de fichier pour le document d'identité.</li><li><strong>Construisez la conversation guidée (le Sujet) :</strong> Dans Copilot Studio, créez un nouveau sujet appelé \"S'inscrire en tant que nouveau client\". Utilisez une série de nœuds <strong>Question</strong> pour capturer de manière fiable les données requises (nom complet, e-mail, etc.) et utilisez le nœud de question <strong>Téléchargement de fichier</strong> pour demander leur passeport ou leur carte d'identité. À la fin, ajoutez un nœud <strong>Action</strong> pour appeler le plugin.</li><li><strong>Créez le moteur intelligent (le plugin d'Action Générative) :</strong> Dans Copilot Studio, créez un nouveau plugin à l'aide d'un flux Power Automate. <ul class=\"list-disc list-inside ml-4 mt-2 space-y-1\"><li><strong>Nom du plugin :</strong> Soumettre une nouvelle demande client pour examen KYC</li><li><strong>Description pour l'IA :</strong> \"Utilisez ceci pour traiter une nouvelle demande client. Il prend le nom, l'e-mail et le fichier du document d'identité du client, exécute l'extraction de données par l'IA et les vérifications AML, et soumet pour approbation de conformité.\"</li><li><strong>Entrées :</strong> Définissez des entrées pour NomClient (texte), EmailClient (texte) et DocumentID (fichier).</li><li><strong>Logique du flux :</strong> Utilisez AI Builder pour extraire les informations du document d'identité. Appelez une API tierce pour le filtrage AML. Publiez une carte adaptative dans Teams pour approbation. Utilisez une logique conditionnelle basée sur l'approbation pour mettre à jour Dataverse et informer les parties prenantes.</li></ul></li><li><strong>Connectez, testez et publiez :</strong> Revenez à votre sujet et connectez le nœud d'action final à votre nouveau plugin, en mappant les variables. Testez rigoureusement avant de publier.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des bases (Conseil de pro)</h5><p class=\"text-gray-600\">Maintenant que vous avez construit votre moteur d'intégration principal en tant que plugin, vous can create des plugins compagnons pour vos équipes internes. Créez un nouveau plugin d'action purement génératif appelé \"Vérifier le statut d'intégration\". Le flux Power Automate interroge simplement votre table \"Cas d'intégration\" dans Dataverse et renvoie le statut. Désormais, un gestionnaire de relations peut simplement demander au Copilot : \"Quel est le statut de la demande de John Smith ?\" et obtenir une réponse instantanée.</p>" },
       { "id": 2, "title": "Terrassez le dragon de la paperasse hypothécaire : de la demande à la souscription en quelques heures", "industry": "Services financiers et bancaires", "technology": "Copilot Studio & Power Automate", "miniDescription": "Maîtrisez le chaos des demandes de prêt hypothécaire en utilisant l'IA pour extraire automatiquement les données de documents tels que les fiches de paie et les relevés bancaires.", "technicalLevel": 8, "problem": "Voici Laura, une agente de crédit dévouée. Son écran est inondé de dizaines de pièces jointes PDF d'un seul demandeur. Elle passe des heures à plisser les yeux devant des relevés bancaires numérisés, à saisir manuellement les chiffres de revenus dans le système de gestion des prêts (LOS) et à envoyer des e-mails polis mais fermes pour réclamer un document manquant. Chaque demande est un marathon administratif de plusieurs jours avant même qu'elle puisse commencer le véritable travail d'évaluation du prêt. C'est inefficace pour la banque et un jeu d'attente stressant pour l'acheteur.", "value": "Pour la plupart des gens, demander un prêt hypothécaire est une quête intimidante, juste après le combat contre un vrai dragon. Pour les agents de crédit, c'est une bataille contre une hydre à plusieurs têtes de paperasse : fiches de paie, relevés bancaires et documents d'identité, qui doivent tous être examinés manuellement et saisis dans un système de gestion des prêts (LOS). Ce processus est lent, fastidieux et propice aux erreurs qui peuvent retarder les approbations et frustrer les clients. Cette solution met de l'ordre dans le chaos, automatise la saisie des données et transmet les demandes à votre équipe de souscription en un temps record.", "roi": "Calculons la valeur de l'automatisation de ce processus lourd en documents.\nA = Temps moyen qu'un agent de crédit passe à traiter manuellement les documents et à saisir les données pour une demande (en heures).\nB = Nombre de demandes de prêt hypothécaire par mois.\nC = Coût horaire moyen chargé d'un agent de crédit.\n\n<code>Formule :\nHeures mensuelles économisées = (A * B)\nÉconomies mensuelles = Heures mensuelles économisées * C</code>\n\nExemple : Si le traitement manuel prend 3 heures par demande (A), que vous recevez 200 demandes par mois (B) et que le coût de votre agent de crédit est de 55 €/heure (C), vous économisez **600 heures** et **33 000 € par mois**, tout en libérant votre équipe pour traiter plus de demandes et fournir un meilleur service client.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le plan de la solution : une approche hybride</h5><p class=\"mb-4 text-gray-600\">Ce cas d'utilisation est un candidat de choix pour une architecture hybride, combinant une conversation guidée avec un traitement intelligent en arrière-plan. Une demande de prêt hypothécaire est un processus hautement structuré et axé sur la conformité. Nous devons nous assurer que chaque document et point de données requis est collecté dans un ordre spécifique, ce qui fait d'un <strong>Sujet</strong> guidé le choix parfait pour l'interaction avec le demandeur. La vraie magie, cependant, se produit en arrière-plan. Nous construirons la logique d'analyse de documents et de saisie de données comme un <strong>plugin Power Automate</strong> puissant et réutilisable, que le Sujet appellera pour effectuer le gros du travail.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de mise en œuvre étape par étape</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Préparez votre fondation (AI Builder & Dataverse) :</strong> Entraînez un modèle personnalisé de <strong>Traitement de documents AI Builder</strong> sur des exemples de fiches de paie. Pour les relevés bancaires, vous pouvez souvent commencer avec le modèle de traitement de factures prédéfini. Créez une table Dataverse pour suivre l'état de la demande.</li><li><strong>Construisez la conversation guidée (le Sujet) :</strong> Dans Copilot Studio, créez un sujet appelé \"Commencer une nouvelle demande de prêt hypothécaire\". Utilisez une série de nœuds <strong>Téléchargement de fichier</strong> pour demander chaque document individuellement. C'est mieux que de tout demander en même temps, car cela vous permet de fournir des instructions claires pour chacun.</li><li><strong>Créez le moteur intelligent (le plugin Power Automate) :</strong> Dans Power Automate, créez un flux avec le déclencheur \"Exécuter depuis Copilot\" et configurez-le comme un plugin. <ul class=\"list-disc list-inside ml-4 mt-2 space-y-1\"><li><strong>Nom du plugin :</strong> Analyser et préparer la demande de prêt hypothécaire</li><li><strong>Description pour l'IA :</strong> \"Traite les documents de prêt hypothécaire téléchargés. Utilise l'IA pour extraire les données des fiches de paie et des relevés bancaires, puis crée une demande pré-remplie dans le système de prêt principal.\"</li><li><strong>Entrées :</strong> Définissez des entrées de fichier pour FichierFicheDePaie, FichierReleveBancaire, FichierID, etc.</li><li><strong>Logique du flux :</strong> Pour chaque entrée de fichier, ajoutez l'action AI Builder \"Extraire les informations de...\" correspondante. Utilisez une action HTTP (premium) pour effectuer un appel API à votre système de gestion des prêts, en le remplissant avec les données extraites.</li></ul></li><li><strong>Connectez, testez et publiez :</strong> Liez le nœud d'action de votre sujet à ce nouveau plugin, en mappant les variables de fichier téléchargées aux entrées du plugin. Effectuez des tests de bout en bout approfondis avec différents types de documents pour vous assurer que vos modèles d'IA sont précis avant de publier.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des bases (Conseil de pro)</h5><p class=\"text-gray-600\">Donnez plus de pouvoir à vos équipes internes avec une action générative compagnon. Créez un nouveau plugin simple pour les agents de crédit appelé \"Obtenir le résumé du demandeur\". Le flux prend le nom du demandeur en entrée, interroge le LOS pour les données pertinentes et renvoie un résumé concis. Désormais, Laura peut simplement taper dans son Copilot Teams : \"Donne-moi un résumé de la demande de Jane Doe\" et obtenir les chiffres clés instantanément sans même ouvrir le LOS.</p>" },
       { "id": 3, "title": "Réinventer les déclarations de sinistres : l'assistant FNOL alimenté par l'IA, disponible 24h/24 et 7j/7", "industry": "Assurance", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un processus de première déclaration de sinistre (FNOL) instantané, empathique et disponible 24h/24 et 7j/7 qui ravit les clients au moment où ils en ont besoin.", "technicalLevel": 5, "problem": "Voici Maria. Elle vient d'avoir un petit accrochage. Elle est secouée mais ça va. La dernière chose qu'elle veut faire, c'est attendre 30 minutes au téléphone, en répétant son histoire à plusieurs personnes. Elle veut juste signaler l'incident, savoir quoi faire ensuite et sentir que sa compagnie d'assurance la soutient. Le processus traditionnel ressemble à un parcours du combattant ; Maria a besoin d'un chemin direct vers la résolution.", "value": "La première déclaration de sinistre (FNOL) est le \"moment de vérité\" dans le monde de l'assurance. C'est la toute première interaction qu'un client a après un événement stressant comme un accident de voiture ou une inondation au sous-sol. Une expérience lente, lourde ou impersonnelle à ce stade peut briser la confiance du client pour toujours. Pour les assureurs, les centres d'appels sont submergés lors d'événements majeurs, et la saisie manuelle des données est lente et incohérente. Cette solution crée un processus FNOL instantané, empathique et disponible 24h/24 et 7j/7.", "roi": "La valeur ici se mesure en économies de coûts, en efficacité et en fidélisation de la clientèle.\nA = Temps moyen qu'un agent passe sur un appel FNOL (en minutes).\nB = Nombre de sinistres par mois.\nC = Coût chargé complet par agent et par heure.\nD = Réduction estimée des fuites de sinistres grâce à une capture initiale des données plus rapide et plus précise (en %).\n\n<code>Formule :\nÉconomies mensuelles sur les agents = ((A * B) / 60) * C\nValeur de la réduction des fuites = (Valeur totale des sinistres * D)</code>\n\nExemple : Si un agent passe 20 minutes par sinistre (A), que vous avez 5 000 sinistres par mois (B) et qu'un agent coûte 45 €/heure (C), vous économisez plus de **1 666 heures** et **75 000 € par mois** rien qu'en coûts d'agents, sans compter l'immense valeur de l'amélioration de la rétention client.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le plan de la solution : une approche axée sur l'Action Générative</h5><p class=\"mb-4 text-gray-600\">Ce cas d'utilisation est un exemple classique où une approche purement basée sur l'Action Générative brille. Une personne qui déclare un sinistre n'utilisera pas de phrases précises et prédéfinies. Elle racontera une histoire. L'exigence principale est que l'IA comprenne le langage naturel de l'utilisateur, extraie les détails clés et lance le processus correct. Un Sujet rigide et scénarisé semblerait froid et échouerait probablement.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de mise en œuvre étape par étape</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Préparez votre fondation (Système de gestion des sinistres & Stockage) :</strong> Assurez-vous que votre système de gestion des sinistres principal est accessible via une API. Configurez Azure Blob Storage pour recevoir et stocker en toute sécurité les photos des dommages.</li><li><strong>Construisez le moteur intelligent (le plugin Power Automate) :</strong> Le nom et la description sont ce que l'IA utilise pour trouver et utiliser votre outil. <ul class=\"list-disc list-inside ml-4 mt-2 space-y-1\"><li><strong>Nom du plugin :</strong> Lancer une nouvelle déclaration de sinistre</li><li><strong>Description pour l'IA :</strong> \"Utilisez ceci pour démarrer une nouvelle déclaration de sinistre pour un preneur d'assurance. Vous aurez besoin de son numéro de police et d'une description de ce qui s'est passé. Vous pouvez également accepter des photos des dommages si l'utilisateur les fournit.\"</li><li><strong>Entrées :</strong> Définissez des entrées pour NuméroDePolice (texte), DescriptionIncident (texte) et PhotosDommages (fichier, facultatif).</li><li><strong>Logique du flux :</strong> Appelez l'API de votre système de gestion des sinistres pour créer l'enregistrement du sinistre. Si des photos sont fournies, enregistrez-les dans Azure Blob Storage. Envoyez une confirmation au client avec son nouvel identifiant de sinistre.</li></ul></li><li><strong>Activez le plugin dans Copilot Studio :</strong> Accédez à la section Plugins, trouvez votre nouveau plugin et activez-le simplement. Assurez-vous que les \"Réponses génératives\" sont activées. Le Copilot est désormais doté d'une compétence de \"déclaration de sinistre\".</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des bases (Conseil de pro)</h5><p class=\"text-gray-600\">Boostez votre plugin avec de l'empathie. Ajoutez une action AI Builder \"Analyser le sentiment\" à votre flux Power Automate. Si le sentiment est fortement négatif, le flux peut automatiquement marquer le sinistre comme \"Haute priorité / Empathie requise\" et avertir un responsable senior, garantissant que vos clients les plus en détresse reçoivent un service impeccable immédiatement.</p>" }
    ]
}